controle/app/Controllers/Vendas.php

    public function index()
    {
        $model = new VendasModel();
        $data['vendas'] = $model->findAll();
---
SELECT *
FROM `vendas`

    public function store()
    {
        helper('form');
        $model = new VendasModel();

        $data = [
            'nome_prod' => $this->request->getPost('nome_prod'),
            'quant'     => $this->request->getPost('quant'),
            'valor'     => $this->request->getPost('valor'),
            'comprador' => $this->request->getPost('comprador'),

        ];

        $model->insert($data);
---
INSERT INTO `vendas` (`nome_prod`, `quant`, `valor`, `comprador`) VALUES ('caneta', '3', '3,50', 'joao')

    public function edit($id)
    {
        helper('form');
        $model = new VendasModel();
        $data['venda'] = $model->find($id);
---
SELECT *
FROM `vendas`
WHERE `vendas`.`id` = '4'

    public function delete($id)
    {
        $model = new VendasModel();
        $model->delete($id);
---
DELETE FROM `vendas`
WHERE `id` IN ('2')